Repository: felimartina/translation-site
Catalog: TranslationsSite/Resources/WhoAreWe/Index.*.resx
Languages: es

# NataliaDominguez_Description
source: Natalia Domínguez is an enthusiastic professional translator. She exclusively renders from English into Spanish —her mother tongue— and provides translation services for Business, Finance, IT, Social and Medical Science sectors. Most part of her projects come from the following fields: Finance (financial documents); Journalism (different pieces of news and articles); general texts concerning Medical topics (health insurance documents, medical guides, etc); Technology issues such as manuals and guidelines for different devices. During the course of the last two years so far, she has been collaborating as a volunteer translator for GlobalVoices (an international news website). In addition, she also has experience as ESL teacher as she has been teaching English at all levels for the last two years. Her accomplishments derived through dedicated, focused and innovative work a s well as to strive for improving by permanent training and studying. She strongly believes that curiosity leads to a desirous of unlimited knowledge and constant improvement.
es: Natalia Domínguez es una traductora apasionada por su profesión. Traduce exclusivamente del inglés al español —su lengua materna— y brinda servicios de traducción en los siguientes sectores: finanzas, informática, ciencias sociales y medicina. La mayor parte de los proyectos en los que ha trabajado pertenecen a los siguientes campos: finanzas (documentos financieros); periodismo (diferentes artículos de noticias); textos generales relacionados a la medicina (documentos de seguros de salud, guías médicas, etc.); temas relacionados a la tecnología tales como manuales y guías para distintos tipos de dispositivos. Durante el transcurso del año pasado y hasta el presente, ha colaborado como traductora voluntaria para GlobalVoices (un sitio web de noticias internacionales). Además, cuenta con experiencia como profesora de inglés ya que a lo largo de estos últimos dos años ha enseñado inglés en todos los niveles. Sus logros derivan del trabajo dedicado, enfocado e innovador; así como también, del esfuerzo por mejorar mediante la capacitación y el estudio constante. Ella cree firmemente que la curiosidad conduce al deseo de conocimientos sin límites y a la mejora continua.

# NataliaDominguez_LinkedinUri
source: https://www.linkedin.com/in/domingueznatalia16/en
es: https://www.linkedin.com/in/domingueznatalia16

# NataliaDominguez_Title
source: English Translator
es: Traductora de Ingles

# OurTeam_Header
source: Our Team
es: Nuestro Equipo

# RominaCastagno_Description
source: Romina Castagno is a professional-grade human translator who provides document translation services from English into Spanish. She works with several specialization areas and a wide range of industries: Energy (oil, gas and alternative energy), Business, Software, Environment, Literature, Fashion, Games applications, among others. She has done edition and proofreading (style, grammar, spelling) of translations for companies in India, USA, Europe, and Argentina. Her tasks consist in working with platforms and tools provided by the agency itself, like Trados, Trados Studios 2009, Wordfast and the ones sent/created by clients. She ensures a fast and trustful work done with coworkers of the same working and competence level than her. Romina has been living and traveling to the US for many years to study and work. One of the most recent clients she is working for is the Pharmacopeia in Washington DC. Her traveling experiences helped her to be immersed into the real culture and language usage so she counts on the linguistic skills and abilities necessary to solve your communication needs, thanks to all her years of professional experience and perfect command of the target and source language.
es: Romina Castagno es una traductora profesional quien brinda servicios de traducción de documentos de inglés a español. Trabaja con áreas de especialidades variadas y un amplio rango de industrias: energía (aceite, gas y energía alternativa), negocios, software, medio ambiente, literatura, moda, aplicaciones de juegos y mucho más. Realizó ediciones, post ediciones (estilo, gramática y ortografía) de traducciones para compañías localizadas en India, Estados Unidos, Europa y Argentina. Su trabajo consiste en operar con plataformas y herramientas que provee la misma empresa, por ejemplo, Trados, Trados Studios 2009, Wordfast y las enviadas/creadas por los mismos clientes. Se compromete a realizar un trabajo rápido y confiable junto a su equipo que posee el mismo nivel y competencia que ella. Romina ha vivido y viajado a los Estados Unidos durante muchos años para estudiar y trabajar. Uno de sus mas recientes clientes para el cual se encuentra trabajando es la Farmacopea en Washington DC. Sus experiencias de viajes la ayudaron a emerger en el uso de la cultura e idioma real, por lo tanto cuenta con las habilidades linguísticas necesarias para resolver sus necesidades de comunicación, gracias a sus años de experiencia profesional y a su perfecto dominio del idioma eta y fuente.

# RominaCastagno_LinkedinUri
source: https://ar.linkedin.com/in/romina-castagno-55834348/en
es: https://www.linkedin.com/in/romina-castagno-55834348

# RominaCastagno_Title
source: English Translator
es: Traductora de Ingles

# VaninaFassi_Description
source: Vanina Fassi is a professional English-Spanish translator specializing in Medicine, Health Care, Pharmaceutical, and Psychology. Investigating and discovering about different subjects drives her to continually improve her knowledge of the translation industry. She has translated and edited for many different companies within several fields, such as sports, journalism, fashion, to name a few. Building long-term client relationship is essential for her, thus she commits herself to satisfy the clients’ requirements by providing them with accurate and high-quality translations. Besides, an active and enthusiastic attitude allows her to meet the agreed delivery date and work with an open and permanent communication. Having worked as a Project Manager gave her the opportunity to coordinate and monitor other linguists’ work; thereby, she is aware of all the stages involved in the process of translation. Her incessant concern to achieve and exceed client expectations makes her a devoted professional focused on the successful completion of every project. Teaching is another important part of her interests, which is why she teaches English to students of all levels and she also offers training courses in reading-comprehension for undergraduate students. Because of her great passion for the language she is constantly challenging her limits and striving to grow both professionally and personally.
es: Vanina Fassi es una traductora profesional de inglés>español especializada en medicina, cuidados de la salud, farmacología y psicología. Investigar y descubrir sobre diferentes temas la impulsa a mejorar de manera continua su conocimiento de la industria de la traducción. Ha traducido y editado para diferentes empresas dentro de varios campos, como deportes, periodismo, moda, por nombrar algunos. La construcción de una relación a largo plazo con los clientes es esencial para ella, por lo que se compromete a satisfacer las necesidades de los clientes proporcionándoles traducciones precisas y de alta calidad. Además, una actitud activa y entusiasta le permite cumplir con la fecha de entrega acordada y trabajar con una comunicación abierta y permanente. Trabajar como coordinadora de proyectos le brindó la oportunidad de coordinar y supervisar el trabajo de otros lingüistas; por lo tanto, conoce todas las etapas involucradas en el proceso de traducción. Su interés incesante para alcanzar y superar las expectativas del cliente la convierten en una profesional dedicada y enfocada en la finalización exitosa de cada proyecto. La enseñanza es otra parte importante de sus intereses, por lo que enseña inglés a alumnos de todos los niveles y también ofrece cursos de lectocomprensión para estudiantes universitarios. Debido a su gran pasión por el idioma desafía constantemente sus límites y se esfuerza por crecer tanto profesional como personalmente.

# VaninaFassi_LinkedinUri
source: https://ar.linkedin.com/in/vaninafassi/en
es: https://www.linkedin.com/in/vaninafassi

# VaninaFassi_Title
source: English Translator
es: Traductora de Ingles

# WhoAreWe_Description
source: As self-motivated professionals, we have set up our own enterprise Re- Make translations where effective communication is our main purpose; and our commitment is to focus on delivering efficient language services. We believe, as detail- oriented linguists, that quality is paramount in the world of translation, and finishing translation assignments on time is an essential part of it. <br> <strong>Re-Make Translations</strong> was founded on a simple business premise to complete professional translation services. We offer multiple levels of service based on client needs, ranging from draft/summary translation up to certified translation, featuring our three-step process with a translator, editor, and proofreader, all designed to meet the evolving needs of global businesses. Regular projects include books, graphic novels, brochures, manuals, newsletters, contracts, patents, help files, ad copy, package copy, labels, websites, and multilingual web banners. <br> As a trustful company, we carefully pair your text to a translator with the appropriate subject matter expertise and background. Competitive Prices and First Class Service, which is our promise to you. In fact, when required, we will send you a detailed quote including a full cost breakdown so you will be delighted by our bills, not shocked.
es: Como emprendedores, hemos creado nuestra agencia Re-make Translation (acá tal vez después lo coloreamos como sea que vaya en el logo) en la que la comunicación efectiva es nuestro principal propósito y nuestro compromiso es centrarnos en brindar servicios de traducción eficientes. Como lingüistas meticulosos creemos que la calidad es de suma importancia en el mundo de la traducción y que finalizar los encargos a tiempo es una parte esencial de nuestro campo <br> <strong>Re-Make Translations</strong> se desarrolló en una premisa simple de negocios para llevar a cabo servicios de traducción profesionales. Ofrecemos múltiples niveles de servicios basados en las necesidades de nuestros clientes, desde traducciones de borradores/resumen hasta traducciones certificadas a través de nuestro proceso triple de traductor, editor y post editor, los cuales cuentan con los estándares de negocios globales. Dentro de los proyectos, podemos encontrar libros, novelas gráficas, folletos, manuales, noticias, contratos, patentes, archivos de ayuda, copia de anuncios comerciales, copia de paquetes, etiquetas, sitios web y cartel web multilingüe. <br> Debido a la confianza de nuestra compañía, los textos son emparejados con el traductor que se especialice en un tema específico con sus conocimientos necesarios y respectivos del tema. Garantizamos precios competitivos junto con un servicio de primera clase; por eso, cuando sea requerido, enviaremos un presupuesto detallado que incluya el costo total y con el cual quede satisfecho y no impactado.

# WhoAreWe_Header
source: Who Are We?
es: Quienes Somos?
